In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('data/sales_february_2014.csv')
df2 = pd.read_csv('data/sales_january_2014.csv')
df3 = pd.read_csv('data/sales_march_2014.csv')

In [3]:
df1.head()

   Customer ID  Customer Name Invoice Number Sale Amount Purchase Date
0         9876  Daniel Farber       100-0008   $1,115.00    2002-02-14
1         8765    Laney Stone       100-0009   $1,367.00    2002-08-14
2         7654   Roger Lipney       100-0010   $2,135.00       2/15/14
3         6543  Thomas Haines       100-0011   $1,346.00       2/17/14
4         5432    Anushka Vaz       100-0012   $1,560.00       2/21/14

In [4]:
df2.head()

   Customer ID  Customer Name Invoice Number Sale Amount Purchase Date
0         1234     John Smith       100-0002   $1,200.00    2001-01-14
1         2345  Mary Harrison       100-0003   $1,425.00    2001-06-14
2         3456     Lucy Gomez       100-0004   $1,390.00    2001-11-14
3         4567   Rupert Jones       100-0005   $1,257.00       1/18/14
4         5678  Jenny Walters       100-0006   $1,725.00       1/24/14

In [5]:
df3.head()

   Customer ID  Customer Name Invoice Number Sale Amount Purchase Date
0         1234     John Smith       100-0014   $1,350.00    2003-04-14
1         8765      Tony Song       100-0015   $1,167.00    2003-08-14
2         2345  Mary Harrison       100-0016   $1,789.00       3/17/14
3         6543     Rachel Paz       100-0017   $2,042.00       3/22/14
4         3456     Lucy Gomez       100-0018   $1,511.00       3/28/14

In [6]:
df = pd.concat([df1, df2, df3])

In [9]:
df

   Customer ID       Customer Name Invoice Number Sale Amount Purchase Date
0         9876       Daniel Farber       100-0008   $1,115.00    2002-02-14
1         8765         Laney Stone       100-0009   $1,367.00    2002-08-14
2         7654        Roger Lipney       100-0010   $2,135.00       2/15/14
3         6543       Thomas Haines       100-0011   $1,346.00       2/17/14
4         5432         Anushka Vaz       100-0012   $1,560.00       2/21/14
5         4321      Harriet Cooper       100-0013   $1,852.00       2/25/14
0         1234          John Smith       100-0002   $1,200.00    2001-01-14
1         2345       Mary Harrison       100-0003   $1,425.00    2001-06-14
2         3456          Lucy Gomez       100-0004   $1,390.00    2001-11-14
3         4567        Rupert Jones       100-0005   $1,257.00       1/18/14
4         5678       Jenny Walters       100-0006   $1,725.00       1/24/14
5         6789  Samantha Donaldson       100-0007   $1,995.00       1/31/14
0         1234          John Smith       100-0014   $1,350.00    2003-04-14
1         8765           Tony Song       100-0015   $1,167.00    2003-08-14
2         2345       Mary Harrison       100-0016   $1,789.00       3/17/14
3         6543          Rachel Paz       100-0017   $2,042.00       3/22/14
4         3456          Lucy Gomez       100-0018   $1,511.00       3/28/14
5         4321       Susan Wallace       100-0019   $2,280.00       3/30/14

In [7]:
len(df)

18

In [13]:
type(df['Sale Amount'].sum())

str

In [30]:
df['Sale Amount'] = df['Sale Amount'].str.strip('$')

In [31]:
df['Sale Amount']

0    1,115.00
1    1,367.00
2    2,135.00
3    1,346.00
4    1,560.00
5    1,852.00
0    1,200.00
1    1,425.00
2    1,390.00
3    1,257.00
4    1,725.00
5    1,995.00
0    1,350.00
1    1,167.00
2    1,789.00
3    2,042.00
4    1,511.00
5    2,280.00
Name: Sale Amount, dtype: object

In [33]:
df['Sale Amount'] = df['Sale Amount'].replace(',','',regex=True).astype(float)

In [34]:
df['Sale Amount']

0    1115.0
1    1367.0
2    2135.0
3    1346.0
4    1560.0
5    1852.0
0    1200.0
1    1425.0
2    1390.0
3    1257.0
4    1725.0
5    1995.0
0    1350.0
1    1167.0
2    1789.0
3    2042.0
4    1511.0
5    2280.0
Name: Sale Amount, dtype: float64

In [37]:
print('Sale Amount 합계', df['Sale Amount'].sum())
print('Sale Amount 합계', df['Sale Amount'].mean())

Sale Amount 합계 28506.0
Sale Amount 합계 1583.6666666666667